_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ПлановыеДоходыРасходыПоДоговору.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_ПлановыеДоходыРасходыПоДоговору</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.УСОERP_ПлановыеДоходыРасходы</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеСогласования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УСОERP_СтатусыСогласованияДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкиПредставленияДокумента</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПлановыеСуммыРасходовПоПериодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяСуммаРасходовНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяСуммаРасходовНаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаРасходовЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НоменклатурнаяГруппа</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяСуммаДоходовНаНачало</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПланируемаяСуммаДоходовНаКонец</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДоходовЗаПериод</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_ПлановыеДоходыРасходы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_ПлановыеДоходыРасходы</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПланируемаяСуммаРасходовПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПланируемаяСуммаДоходовПоДоговору</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_ПлановыеДоходыРасходыПоДоговору/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПредыдущиеРеквизитыШапки; //используется для проверки при изменении реквизитов шапки

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Внешние обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		ПриЧтенииСозданииНаСервере();
		
	КонецЕсли; 	
	
	ФлагОткрытияФормы = Истина;
	КодФормы = "ПлановыеРасходыПоДоговору";
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;		
	
	// ИнтеграцияС1СДокументооборотом
	ИнтеграцияС1СДокументооборот.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ИнтеграцияС1СДокументооборотом
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства 

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды   	
	
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);	
	
	Если Объект.ПлановыеСуммыРасходовПоПериодам.Количество()>0 Тогда
		ОбновитьОборотыПоПериодам();
	КонецЕсли;	
	
	СтруктураНастроек = Объект.Ссылка.НастройкиПредставленияДокумента.Получить();
	Если ЗначениеЗаполнено(СтруктураНастроек) И ТипЗнч(СтруктураНастроек) = Тип("Структура") Тогда
		
		Если СтруктураНастроек.Свойство("ОтображатьПодразделение") Тогда
			ОтображатьПодразделение = СтруктураНастроек.ОтображатьПодразделение;
		КонецЕсли;
		
		Если СтруктураНастроек.Свойство("ОтображатьГруппуПродукции") Тогда
			ОтображатьГруппуПродукции = СтруктураНастроек.ОтображатьГруппуПродукции;
		КонецЕсли;
				
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтображатьПодразделениеПриИзменении(Неопределено);
	ОтображатьГруппуПродукцииПриИзменении(Неопределено);
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды  
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
	//// Обработчик механизма "ДатыЗапретаИзменения"
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);
	//
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(РезультатВыбора, ИсточникВыбора)
		
	Если Окно <> Неопределено Тогда
		Окно.Активизировать();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Если документ проводится, предложим дозаполнить недостающие данные
	//Если ПараметрыЗаписи.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//	
	//	РассчитатьИтоговыеПоказателиЗаказаНаПеревозку(ЭтаФорма);

	//КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства 	
	
	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);	

	СтруктураНастроек = Новый Структура("ОтображатьПодразделение, ОтображатьГруппуПродукции", 
										ОтображатьПодразделение, ОтображатьГруппуПродукции);    	
	Сжатие = Новый СжатиеДанных(9);
	ТекущийОбъект.НастройкиПредставленияДокумента = Новый ХранилищеЗначения(СтруктураНастроек, Сжатие);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("Запись_ПлановыеРасходыПоДоговору", ПараметрыЗаписи, Объект.Ссылка);

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
	//СтруктураНаименованийТабличныхЧастей = Новый Структура("КДоставке,Затраты");
	//ЗаполнитьСлужебныеРеквизитыПоНоменклатуре(СтруктураНаименованийТабличныхЧастей);

	//РассчитатьИтоговыеПоказателиЗаказаНаПеревозку(ЭтаФорма);
	
	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
#КонецОбласти


#Область Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	//УстановитьВидимостьЭлементовПоВидуОперацииСервер();
	//
	//РассчитатьИтоговыеПоказателиВыполненияРабот(ЭтаФорма);
	Если НЕ ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный	= Пользователи.ТекущийПользователь();
	КонецЕсли;	
	
	Элементы.ГруппаКомментарий.Картинка = ОбщегоНазначения.ПолучитьКартинкуКомментария(Объект.Комментарий);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодчиненныеСвойстваПоСтатистике(ИмяРеквизитаРодителя)
	
	ЗаполнениеСвойствПоСтатистикеСервер.ЗаполнитьПодчиненныеСвойства(Объект, ИмяРеквизитаРодителя);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	ПериодПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПриИзмененииНаСервере()
	Объект.ПериодНачала = НачалоМесяца(Объект.ПериодНачала);
	Если НЕ ЗначениеЗаполнено(Объект.ПериодОкончания) Тогда
		Объект.ПериодОкончания = КонецМесяца(Объект.ПериодНачала);
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ПериодОкончанияПриИзменении(Элемент)
	ПериодОкончанияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодОкончанияПриИзмененииНаСервере()
	Объект.ПериодОкончания = КонецМесяца(Объект.ПериодОкончания);
КонецПроцедуры

&НаСервере
Функция ВернутьОборотыНаДату(Организация, Контрагент, Договор, ОбъектСтроительства, НачалоПериода, ОкончаниеПериода)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	Запрос.УстановитьПараметр("ОбъектСтроительства", ОбъектСтроительства);
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.УстановитьПараметр("ОкончаниеПериода", ОкончаниеПериода);
	Запрос.Текст = "ВЫБРАТЬ
	               |	УСОERP_ПлановыеРасходыОбороты.Период КАК Период,
	               |	УСОERP_ПлановыеРасходыОбороты.Подразделение КАК Подразделение,
	               |	УСОERP_ПлановыеРасходыОбороты.НоменклатурнаяГруппа КАК НоменклатурнаяГруппа,
	               |	СУММА(ЕСТЬNULL(УСОERP_ПлановыеРасходыОбороты.ПланируемаяСуммаДоходовПоДоговоруОборот, 0)) КАК СуммаДоходов,
	               |	СУММА(ЕСТЬNULL(УСОERP_ПлановыеРасходыОбороты.ПланируемаяСуммаРасходовПоДоговоруОборот, 0)) КАК СуммаРасходов
	               |ИЗ
	               |	РегистрНакопления.УСОERP_ПлановыеДоходыРасходы.Обороты(
	               |			&НачалоПериода,
	               |			&ОкончаниеПериода,
	               |			Месяц,
	               |			Организация = &Организация
	               |				И Контрагент = &Контрагент
	               |				И Договор = &Договор
	               |				И ОбъектСтроительства = &ОбъектСтроительства) КАК УСОERP_ПлановыеРасходыОбороты
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	УСОERP_ПлановыеРасходыОбороты.Подразделение,
	               |	УСОERP_ПлановыеРасходыОбороты.НоменклатурнаяГруппа,
	               |	УСОERP_ПлановыеРасходыОбороты.Период
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Подразделение,
	               |	НоменклатурнаяГруппа,
	               |	Период";
	Возврат Запрос.Выполнить().Выбрать();			   
	
КонецФункции

&НаСервере
Процедура ЗаполнитьПлановыеСуммыРасходовНаСервере(Отказ = Ложь, ТекстОшибки ="")
	
	Объект.ПлановыеСуммыРасходовПоПериодам.Очистить();
	
	Если НЕ ЗначениеЗаполнено(Объект.ПериодНачала) Или НЕ ЗначениеЗаполнено(Объект.ПериодОкончания) Тогда
		Отказ = Истина;
		ТекстОшибки = "Не определен период формирования данных!"; 
		Возврат;
	КонецЕсли;	
	
	Если  НЕ ЗначениеЗаполнено(Объект.Организация) Или НЕ ЗначениеЗаполнено(Объект.Контрагент) 
		Или НЕ ЗначениеЗаполнено(Объект.Договор) Или НЕ ЗначениеЗаполнено(Объект.ОбъектСтроительства) Тогда
		Отказ = Истина;
		ТекстОшибки = "Не все реквизиты заполнены!";
		Возврат;
	КонецЕсли;
	
	РезультатЗапроса = ВернутьОборотыНаДату(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.ОбъектСтроительства, Объект.ПериодНачала, Объект.ПериодОкончания);
	
	Пока РезультатЗапроса.Следующий() Цикл
		стрПлановыхСумм 									= Объект.ПлановыеСуммыРасходовПоПериодам.Добавить();
		стрПлановыхСумм.Период 								= РезультатЗапроса.Период;
		стрПлановыхСумм.Подразделение 						= РезультатЗапроса.Подразделение;
		стрПлановыхСумм.НоменклатурнаяГруппа 				= РезультатЗапроса.НоменклатурнаяГруппа;			
		стрПлановыхСумм.ПланируемаяСуммаРасходовНаНачало 	= РезультатЗапроса.СуммаРасходов;
		стрПлановыхСумм.ПланируемаяСуммаДоходовНаНачало 	= РезультатЗапроса.СуммаДоходов;
	КонецЦикла;	
												
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеСуммыРасходов(Команда)
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПлановыеСуммыРасходовПродолжение",ЭтотОбъект),"Табличная часть будет очищена! Продолжить?", РежимДиалогаВопрос.ДаНет);
		
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеСуммыРасходовПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	ТекстОшибки ="";

	ЗаполнитьПлановыеСуммыРасходовНаСервере(Отказ, ТекстОшибки);
	Модифицированность = Истина;
	
	Если Отказ Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьОборотыПоПериодам()
	//Для каждого стрПлановыхСумм Из Объект.ПлановыеСуммыРасходовПоПериодам Цикл
	//	
	//	РезультатЗапроса = ВернутьОборотыНаДату(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.ОбъектСтроительства, стрПлановыхСумм.Период - 1);
	//	Если РезультатЗапроса.Следующий() Тогда
	//		стрПлановыхСумм.ПланируемаяСуммаРасходовНаНачало = РезультатЗапроса.СуммаРасходов;
	//	КонецЕсли;	
	//				   
	//	РезультатЗапроса = ВернутьОборотыНаДату(Объект.Организация, Объект.Контрагент, Объект.Договор, Объект.ОбъектСтроительства, КонецМесяца(стрПлановыхСумм.Период));
	//	Если РезультатЗапроса.Следующий() Тогда
	//		стрПлановыхСумм.ПланируемаяСуммаРасходовНаКонец = РезультатЗапроса.СуммаРасходов;
	//	КонецЕсли;
	//	
	//КонецЦикла;	
КонецПроцедуры	

&НаКлиенте
Процедура ДоговораПериодПриИзменении(Элемент)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Период = НачалоМесяца(ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.Период);
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПодразделениеПриИзменении(Элемент)
	
	Элементы.ДоговораПодразделение.Видимость = ОтображатьПодразделение;

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьГруппуПродукцииПриИзменении(Элемент)
	
	Элементы.ДоговораГруппаПродукции.Видимость = ОтображатьГруппуПродукции;

КонецПроцедуры

&НаКлиенте
Процедура ДоговораПланируемаяСуммаДоходовНаКонецПриИзменении(Элемент)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СуммаДоходовЗаПериод =  ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ПланируемаяСуммаДоходовНаКонец - ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ПланируемаяСуммаДоходовНаНачало;
КонецПроцедуры

&НаКлиенте
Процедура ДоговораПланируемаяСуммаРасходовНаКонецПриИзменении(Элемент)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.СуммаРасходовЗаПериод =  ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ПланируемаяСуммаРасходовНаКонец - ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ПланируемаяСуммаРасходовНаНачало;
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДанныеДоговора = ПолучитьДанныеПоДоговору(Объект.Договор);
	ЗаполнитьЗначенияСвойств(Объект, ДанныеДоговора);
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьДанныеПоДоговору(Договор)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Ссылка КАК ДополнительныеПараметрыПоДоговору,
		|	УСОERP_ДополнительныеПараметрыПоДоговору.ОбъектСтроительства
		|ИЗ
		|	Документ.УСОERP_ДополнительныеПараметрыПоДоговору КАК УСОERP_ДополнительныеПараметрыПоДоговору
		|ГДЕ
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Договор = &Договор
		|	И НЕ УСОERP_ДополнительныеПараметрыПоДоговору.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	УСОERP_ДополнительныеПараметрыПоДоговору.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Договор", Договор);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ОбъектСтроительства = Справочники.СМ_ОбъектыСтроительства.ПустаяСсылка();
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОбъектСтроительства = Выборка.ОбъектСтроительства;
	КонецЕсли;
	
	Возврат Новый Структура("Организация, ОбъектСтроительства, ПериодНачала, ПериодОкончания", Договор.Организация, ОбъектСтроительства, Договор.ДатаНачалаДействия, Договор.ДатаОкончанияДействия);
	
КонецФункции

// СтандартныеПодсистемы.Свойства 
&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()

	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);

КонецПроцедуры

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства

КонецПроцедуры

&НаСервере
Процедура ОбъектСтроительстваПриИзмененииНаСервере()
	Объект.НаправлениеДеятельности = Объект.ОбъектСтроительства.ОбъектСтроительства.НаправлениеДеятельности;
КонецПроцедуры

&НаКлиенте
Процедура ОбъектСтроительстваПриИзменении(Элемент)
	ОбъектСтроительстваПриИзмененииНаСервере();
КонецПроцедуры

#КонецОбласти
